/**
 * Деструктуризація об'єкта
 * Деструктуризація неіснуючих властивостей
 * Перейменування змінної
 * Значення за замовчуванням
 */

const user = {
  username: 'Jacob name',
  skills: {
    html: true,
    css: false,
    js: true,
  },
};

/**
 * Глибока деструктуризація об'єкта
 */

const { skills } = user;

// console.log("html", html);
// console.log("css", css);
// console.log("js", js);

/**
 * Деструктуризація масива
 * Синтаксис
 * Значення за замовчуванням
 * Часткова деструктурізація
 * Пропуск значень
 * Деструктурізація параметрів
 * Переваги
 */

const arr = [1, 2, 3, 4, 5];
